; domain
(define (domain team_fortress_mic_usage)
  (:requirements :strips :typing)
  (:types entity attribute)

  (:predicates
    (connected ?entity - entity)
    (plugged-in ?entity - entity)
    (functional ?entity - entity)
    (tested ?entity - entity)
    (visible ?entity - entity)
    (open ?entity - entity)
    (selected ?entity - entity)
    (heard ?entity - entity)
    (talking ?entity - entity)
    (efficient ?entity - entity)
    (possible ?entity - entity)
    (supported ?entity - entity)
  )

  (:action make_microphone_working
    :parameters (?microphone - entity)
    :precondition (and (not (connected ?microphone)) (not (plugged-in ?microphone)) (not (functional ?microphone)) (not (tested ?microphone)))
    :effect (and (connected ?microphone) (plugged-in ?microphone) (functional ?microphone) (tested ?microphone))
  )

  (:action adjust_panel_visibility
    :parameters (?panel - entity)
    :precondition (and (not (visible ?panel)) (not (open ?panel)))
    :effect (and (visible ?panel) (open ?panel))
  )

  (:action select_voice_panel
    :parameters (?panel - entity)
    :precondition (and (visible ?panel) (not (selected ?panel)))
    :effect (selected ?panel)
  )

  (:action talk_using_microphone
    :parameters (?microphone - entity ?voice - entity)
    :precondition (and (connected ?microphone) (functional ?microphone) (not (heard ?voice)))
    :effect (heard ?voice)
  )

  (:action use_microphone_efficiently
    :parameters (?voice - entity)
    :precondition (and (heard ?voice) (not (efficient ?voice)))
    :effect (efficient ?voice)
  )

  (:action advise_teammates
    :parameters (?advice - entity)
    :precondition (not (possible ?advice))
    :effect (possible ?advice)
  )
)

; problem
(define (problem use_mic_in_team_fortress)
  (:domain team_fortress_mic_usage)

  (:objects
    mic - entity
    panel - entity
    voice - entity
    advice - entity
  )

  (:init
    (not (connected mic))
    (not (plugged-in mic))
    (not (functional mic))
    (not (tested mic))
    (not (visible panel))
    (not (open panel))
    (not (selected panel))
    (not (heard voice))
    (not (efficient voice))
    (not (possible advice))
  )

  (:goal
    (and
      (connected mic)
      (plugged-in mic)
      (functional mic)
      (tested mic)
      (visible panel)
      (open panel)
      (selected panel)
      (heard voice)
      (efficient voice)
      (possible advice)
    )
  )
)

; plan
1. (make_microphone_working mic)
   added: (connected mic) (plugged-in mic) (functional mic) (tested mic)
   goals met: 4 of 10
2. (adjust_panel_visibility panel)
   added: (visible panel) (open panel)
   goals met: 6 of 10
3. (talk_using_microphone mic voice)
   added: (heard voice)
   goals met: 7 of 10
4. (advise_teammates advice)
   added: (possible advice)
   goals met: 8 of 10
5. (select_voice_panel panel)
   added: (selected panel)
   goals met: 9 of 10
6. (use_microphone_efficiently voice)
   added: (efficient voice)
   goals met: 10 of 10
